app/views/users/profile.html.erb

SELECT "dogs".* FROM "dogs" WHERE "dogs"."user_id" = $1  [["user_id", 9]]
---
<h2>This is <%= @user.email %>, owner of </h2>
<% @user.dogs.each do |dog| %>