app/controllers/dogs_controller.rb

  def index
    @dogs = Dog.all
---
SELECT "dogs".* FROM "dogs"

  def create
    @dog = Dog.new(dog_params)
    @dog.user = current_user
    if @dog.save
---
INSERT INTO "dogs" ("age", "created_at", "gender", "name", "preference", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["age", "11"], ["created_at", Mon, 21 Oct 2013 20:54:18 UTC +00:00], ["gender", "Female"], ["name", "City"], ["preference", "Males"], ["updated_at", Mon, 21 Oct 2013 20:54:18 UTC +00:00]]

  def show
    @dog = Dog.find(params[:id])
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = $1 LIMIT 1  [["id", "1"]]