app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "zipcode") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["password_digest", "$2a$10$invhDlvLuYViyKxX4/6jI.5IcEOvvp5fQNc6KgkbUb9f.COFjQXu."], ["updated_at", Mon, 21 Oct 2013 23:56:58 UTC +00:00]]
---
  def update
  @user = User.find params[:id]

    respond_to do |format|
      if @user.update_attributes(user_params)

DELETE FROM "dogs_users" WHERE "dogs_users"."user_id" = 1
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    if @user.destroy