app/views/users/dogs/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
SELECT "dogs".* FROM "dogs" WHERE "dogs"."user_id" = $1  [["user_id", 6]]
---
<% @user = User.find(current_user) %>
<h1><%= @user.email %>'s dogs: </h1>
<% @user.dogs.each do |dog| %><br>